package ru.sortlab.sorting;

import ru.sortlab.collection.CustomArrayList;

import java.util.Comparator;

/**
 * Cортировка вставками.
 *
 * Идея алгоритма:
 *
 * 1. Первый элемент считаем отсортированным.
 * 2. Берём следующий элемент.
 * 3. Сравниваем его с предыдущими.
 * 4. Сдвигаем большие элементы вправо.
 * 5. Вставляем элемент на правильное место.
 *
 * Повторяем, пока не закончатся элементы.
 *
 * implements SortStrategy<T> означает,
 * что класс реализует наш общий интерфейс
 * сортировки.
 */
public class InsertionSort<T> implements SortStrategy<T> {

    @Override
    public void sort(CustomArrayList<T> elements, Comparator<T> comparator){

        // начинаю с первого индекса, так как он сам по себе уже является отсортированной
        // последовательностью из одного объекта
        for (int i = 1; i < elements.getSize(); i++){

            // элемент, который хотим вставить в правильную позицию
            T key = elements.get(i);

            // индекс элемента расположенного слева от key
            int j = i - 1;

            //Пока выполняются два условия:
            //1. j >= 0:
            //    мы не вышли за начало коллекции.
            //2. compare(...) > 0:
            //    текущий элемент больше key.

            // в цикле проверяем,
            // что мы всё ещё находимся внутри коллекции и элемент слева больше того который будем вставлять
            while (j >= 0 && comparator.compare(elements.get(j), key) > 0){
                // Перемещаем элемент вправо.
                //  Например:
                //  [600, 340]
                //  Сохранили 340 в key.
                //  Теперь копируем 600
                //  на позицию с индексом 1.
                //  Временно получим:
                //  [600, 600]
                //340 хранится в переменной key.

                elements.set(j + 1, elements.get(j));

                // переходим к предыдущему элементу слева
                j--;
            }
            //Нашли место для key.
            elements.set(j + 1, key);

        }
    }
}
