
package ru.sortlab.sorting;

import ru.sortlab.collection.CustomArrayList;
import java.util.Comparator;

/**
 * Сортировка выбором.
 *
 * Алгоритм:
 *
 * 1. Находим минимальный элемент.
 * 2. Меняем его местами с первым.
 * 3. Ищем минимум среди оставшихся.
 * 4. Меняем его местами со вторым.
 * 5. Повторяем до завершения сортировки.
 */
public class SelectionSort<T> implements SortStrategy<T> {

    @Override
    public void sort(
            CustomArrayList<T> elements,
            Comparator<T> comparator
    ) {


        //Получаем количество элементов.
        int n = elements.getSize();

        //Внешний цикл определяет позицию, на которую мы будем ставить минимальный элемент.

        for (int i = 0; i < n - 1; i++) {

            //Предполагаем, что минимальный элемент находится на позиции i
            int minIndex = i;

            //*
            //Ищем минимальный элемент
            //* среди ещё неотсортированных.
            //* Начинаем с i + 1,
            //* поскольку элемент i уже
            //* выбран как текущий минимум.
            for (int j = i + 1; j < n; j++) {

                //Сравниваем элемент j с текущим минимумом.
                //Если результат отрицательный, значит нашли меньший элемент.

                if (comparator.compare(
                        elements.get(j),
                        elements.get(minIndex)
                ) < 0) {

                    //Запоминаем индекс нового минимального элемента.
                    minIndex = j;
                }
            }

            //Если минимум находится не на i, меняем элементы местами.

            // Если minIndex == i, перестановка не нужна.

            if (minIndex != i) {

                //Сохраняем объект с позиции i. Без временной переменной мы потеряли бы этот объект после первой замены.

                T temp = elements.get(i);

                // Ставим минимальный элемент на текущую позицию.
                elements.set(i, elements.get(minIndex));

                //Переносим старый элемент на место найденного минимума.

                elements.set(minIndex, temp);
            }
        }
    }
}
